In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sls

In [4]:
df=pd.read_csv(r"C:\Users\ebuka\Desktop\python\titanic.csv")

In [6]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
# 1. Fill missing values in the Age column with the mean
df['Age'] = df['Age'].fillna(df['Age'].mean())

# 2. Fill missing values in the Embarked column with the most frequent value (mode)
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])

# Dropping Rows and Columns:
# 3. Drop the Cabin column due to a high number of missing values
df = df.drop(columns=['Cabin'])

# 4. Drop rows where Fare is missing
df = df.dropna(subset=['Fare'])

# Changing Data Types:
# 5. Convert the Age column to an integer type
df['Age'] = df['Age'].astype(int)

# 6. Convert the Survived column to categorical data (0 = dead, 1 = alive)
df['Survived'] = df['Survived'].map({0: 'dead', 1: 'alive'}).astype('category')

# Display the cleaned DataFrame
print(df.head())

   PassengerId Survived Pclass  \
0            1     dead      3
1            2    alive      1
2            3    alive      3
3            4    alive      1
4            5     dead      3

                                                Name     Sex  Age  SibSp  \
0                            Braund, Mr. Owen Harris    male   22      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38      1
2                             Heikkinen, Miss. Laina  female   26      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35      1
4                           Allen, Mr. William Henry    male   35      0

   Parch            Ticket     Fare Embarked
0      0         A/5 21171   7.2500        S
1      0          PC 17599  71.2833        C
2      0  STON/O2. 3101282   7.9250        S
3      0            113803  53.1000        S
4      0            373450   8.0500        S

In [14]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

#### Number 1

In [20]:
# Count the number of survivors and those who died
survival_counts = df['Survived'].value_counts()

print(f"Survived: {survival_counts['alive']}")
print(f"Died: {survival_counts['dead']}")

Survived: 342
Died: 549

#### Number 2

In [25]:
# Count the number of passengers in each class
class_counts = df['Pclass'].value_counts()

print(f"First Class Passengers: {class_counts[1]}")
print(f"Second Class Passengers: {class_counts[2]}")
print(f"Third Class Passengers: {class_counts[3]}")

First Class Passengers: 216
Second Class Passengers: 184
Third Class Passengers: 491

#### Number 3

In [28]:
# Count the number of male and female passengers
gender_counts = df['Sex'].value_counts()

print(f"Male Passengers: {gender_counts['male']}")
print(f"Female Passengers: {gender_counts['female']}")

Male Passengers: 577
Female Passengers: 314

#### Number 4

In [31]:
# Calculate the survival rate by gender
survival_by_gender = df.groupby('Sex')['Survived'].value_counts(normalize=True).unstack()

print(survival_by_gender)

Survived      dead     alive
Sex
female    0.257962  0.742038
male      0.811092  0.188908

C:\Users\ebuka\AppData\Local\Temp\ipykernel_18800\1047342010.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  survival_by_gender = df.groupby('Sex')['Survived'].value_counts(normalize=True).unstack()

#### Number 5

In [34]:
# Calculate the survival rate by passenger class
survival_by_class = df.groupby('Pclass')['Survived'].value_counts(normalize=True).unstack()

print(survival_by_class)

Survived      dead     alive
Pclass
1         0.370370  0.629630
2         0.527174  0.472826
3         0.757637  0.242363

C:\Users\ebuka\AppData\Local\Temp\ipykernel_18800\2209273476.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  survival_by_class = df.groupby('Pclass')['Survived'].value_counts(normalize=True).unstack()